@Reeta580 Thanks for raising this issue.
Could you please double check that you are indeed using **v3.26.0** of the AWS Provider?
I have verified that there is not an issue with the latest provider version:

```console
$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_backup_plan.test_backup will be created
  + resource "aws_backup_plan" "test_backup" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "test_backup_plan"
      + version = (known after apply)

      + advanced_backup_setting {
          + backup_options = {
              + "WindowsVSS" = "enabled"
            }
          + resource_type  = "EC2"
        }

      + rule {
          + completion_window = 180
          + rule_name         = "test_backup_rule"
          + schedule          = "cron(0 16 * * ? *)"
          + start_window      = 60
          + target_vault_name = "target_vault"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

-----------------------------------------------------------------------
```

Support for `advanced_backup_setting` was added via #15341 and released with [**v3.11.0**](https://github.com/hashicorp/terraform-provider-aws/blob/main/CHANGELOG.md#3110-october-15-2020) of the AWS Provider.